Revit 2027 API
AreaReinforcement.AreaReinforcementType Property
 Retrieves the type of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaReinforcementType AreaReinforcementType { get; }
Public ReadOnly Property AreaReinforcementType As AreaReinforcementType
	Get
public:
property AreaReinforcementType^ AreaReinforcementType {
	AreaReinforcementType^ get ();
}
member AreaReinforcementType : AreaReinforcementType with get
Property Value
AreaReinforcementType
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace